# Bonus: Temperature Analysis I

In [2]:
import pandas as pd
from datetime import datetime as dt

In [3]:
# "tobs" is "temperature observations"
df = pd.read_csv('Resources/hawaii_measurements.csv')
df.head()

       station        date  prcp  tobs
0  USC00519397  2010-01-01  0.08    65
1  USC00519397  2010-01-02  0.00    63
2  USC00519397  2010-01-03  0.00    74
3  USC00519397  2010-01-04  0.00    76
4  USC00519397  2010-01-06   NaN    73

In [4]:
# Convert the date column format from string to datetime
df['date']= pd.to_datetime(df['date'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19550 entries, 0 to 19549
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   station  19550 non-null  object
 1   date     19550 non-null  datetime64[ns]
 2   prcp     18103 non-null  float64
 3   tobs     19550 non-null  int64
dtypes: datetime64[ns](1), float64(1), int64(1), object(1)
memory usage: 611.1+ KB

In [5]:
# Set the date column as the DataFrame index
df.set_index('date', inplace=True)

In [6]:
# Drop the date column
df.reset_index(drop=True, inplace=True)

In [7]:
df

           station  prcp  tobs
0      USC00519397  0.08    65
1      USC00519397  0.00    63
2      USC00519397  0.00    74
3      USC00519397  0.00    76
4      USC00519397   NaN    73
...            ...   ...   ...
19545  USC00516128  0.09    71
19546  USC00516128   NaN    78
19547  USC00516128  0.56    76
19548  USC00516128  0.50    76
19549  USC00516128  0.45    76

[19550 rows x 3 columns]

### Compare June and December data across all years

In [8]:
from scipy import stats

In [9]:
newdf = pd.read_csv('Resources/hawaii_measurements.csv')
newdf.head()

       station        date  prcp  tobs
0  USC00519397  2010-01-01  0.08    65
1  USC00519397  2010-01-02  0.00    63
2  USC00519397  2010-01-03  0.00    74
3  USC00519397  2010-01-04  0.00    76
4  USC00519397  2010-01-06   NaN    73

In [10]:
newdf['date']= pd.to_datetime(newdf['date'])
newdf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19550 entries, 0 to 19549
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   station  19550 non-null  object
 1   date     19550 non-null  datetime64[ns]
 2   prcp     18103 non-null  float64
 3   tobs     19550 non-null  int64
dtypes: datetime64[ns](1), float64(1), int64(1), object(1)
memory usage: 611.1+ KB

In [11]:
# newdf.loc[newdf['date'].dt.month == 12]

In [12]:
# Filter data for desired months
# newdf.loc[newdf['date'].dt.month == 6]
newdfdate=newdf.loc[newdf['date'].dt.month.isin([6,12])]

In [13]:
newdfdate.head(1000)

          station       date  prcp  tobs
133   USC00519397 2010-06-01  0.00    78
134   USC00519397 2010-06-02  0.01    76
135   USC00519397 2010-06-03  0.00    78
136   USC00519397 2010-06-04  0.00    76
137   USC00519397 2010-06-05  0.00    77
...           ...        ...   ...   ...
6001  USC00514830 2011-12-16  0.07    69
6002  USC00514830 2011-12-18   NaN    71
6003  USC00514830 2011-12-19  0.16    70
6004  USC00514830 2011-12-20  0.05    70
6005  USC00514830 2011-12-21  0.25    72

[1000 rows x 4 columns]

In [18]:
# Identify the average temperature for June
Avg_temp_June = newdfdate.loc[newdf["date"].dt.month == 6]["tobs"]
Avg_temp_June.mean()

74.94411764705882

In [19]:
# Identify the average temperature for December
Avg_temp_Dec = newdfdate.loc[newdf["date"].dt.month == 12]["tobs"]
Avg_temp_Dec.mean()

71.04152933421226

In [20]:
# Run paired t-test
stats.ttest_ind(Avg_temp_June, Avg_temp_Dec, equal_var=False)

Ttest_indResult(statistic=31.355036920962423, pvalue=4.193529835915755e-187)

### Analysis

Average temperature is for Dec is less than average temperature of June
i have used an unpaired t-test as both the  tempearture months are  independent or are in unrelated groups